[react] @

Что такое React? .
. Реакт - библиотека JavaScript для создания пользовательского интерфейса. 
  Пользовательский интерфейс - это маленькие части, такие, как кнопки, текст, картинки. React позволяет создавать их в виде компонентов, чтобы потом переиспользовать и вкладывать друг в друга.
Что такое компоненты? .
. Приложения, созданные на React, использую компоненты. 
  `Компоненты` - это изолированные части пользовательского интерфейса. Внутри компонент это JavaScript функция, в которую можно вставлять разметку, используя <JSX>. Компонентом может быть и маленькая кнопка и целая страница.